Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Especially big thanks to Yoshikazu Nojima for creating the first infrastructure to handle ja.quarkus.io translations using a mix of computer aided translation and human edit/verification. Big thanks for Zheng Feng and Ruben Novelli to reuse this setup for for cn.quarkus.io and es.quarkus.io respectivelly.
ja_jp: 特に、コンピュータ支援翻訳と人間の編集・検証を組み合わせてja.quarkus.ioの翻訳を扱う最初のインフラを構築してくれたYoshikazu Nojimaに感謝します。この設定をcn.quarkus.ioとes.quarkus.ioに再利用してくれたZheng FengとRuben Novelliにもそれぞれ大きな感謝をしています。

source: Essentially what this class does is force Jackson to not include quotes in the field names.
ja_jp: 基本的にこのクラスが行うことは、フィールド名に引用符を含めないよう Jackson に強制することです。

source: Essentially, any `QuarkusTestProfile` with at least one matching tag matching the value of `quarkus.test.profile.tags` will be considered active and all the tests annotated with `@TestProfile` of active profiles, will be run while the rest will be skipped. This is best shown in the following example.
ja_jp: 基本的に、 `quarkus.test.profile.tags` の値と一致するタグが少なくとも 1 つある `QuarkusTestProfile` はアクティブであると見なされ、アクティブなプロファイルの `@TestProfile` でアノテーションが付けられたすべてのテストが実行されますが、それ以外はスキップされます。以下は、その典型的な例です。

source: Essentially, they bring much needed improvements for analysing code paths that get included in the native binary. Debugging these code paths aims to answer questions such as:
ja_jp: 基本的には、ネイティブ・バイナリに含まれるコード・パスを分析するために必要な改良が施されています。これらのコードパスをデバッグすることで、以下のような疑問に答えることができます。

source: Eval Section
ja_jp: Eval セクション

source: Evaluates to `true` if `value1` is equal to `value2`.
ja_jp: `value1` が `value2` と等しい場合は `true` と評価されます。

source: Evaluates to `true` if `value1` is greater than `value2`.
ja_jp: `value1` が `value2` より大きい場合は `true` と評価されます。

source: Evaluates to `true` if `value1` is greater than or equal to `value2`.
ja_jp: `value1` が `value2` 以上の場合、`true` と評価されます。

source: Evaluates to `true` if `value1` is less than `value2`.
ja_jp: `value1` が `value2` より小さい場合は `true` と評価されます。

source: Evaluates to `true` if `value1` is less than or equal to `value2`.
ja_jp: `value1` が `value2` 以下の場合は `true` と評価されます。

source: Evaluates to `true` if `value1` is not equal to `value2`.
ja_jp: `value1` が `value2` と等しくない場合は `true` と評価されます。

source: Evaluates to `true` if both operands evaluate to `true`.
ja_jp: 両方のオペランドが `true` と評価された場合は `true` と評価されます。

source: Evaluates to `true` if one of the operands evaluates to `true`.
ja_jp: オペランドの 1 つが `true` と評価された場合、`true` と評価されます。

source: Evaluation of `CompletionStage` and `Uni` Objects
ja_jp: `CompletionStage` と `Uni` オブジェクトの評価

source: Evangelize Quarkus across teams and clients
ja_jp: チームやクライアントにQuarkusを広める

source: Even a better option is to use a `hybrid` application type in devmode:
ja_jp: さらに良いオプションは、devmode で「ハイブリッド」アプリケーション タイプを使用することです:

source: Even if the Quarkus Development CA is installed, you can generate a self-signed certificate:
ja_jp: Quarkus Development CA がインストールされている場合でも、自己署名証明書を生成できます。

source: Even more detail can be obtained by passing in `--verbose` as an additional native-image build argument. This option can be very useful in detecting whether the options that you pass at a high level via Quarkus are being passed down to the native executable production, or whether some third party jar has some native-image configuration embedded in it that is reaching the native-image invocation:
ja_jp: ネイティブイメージビルドの追加引数として `--verbose` を渡すことで、さらに詳細な情報を得ることができます。このオプションは、Quarkusを介して高いレベルで渡されたオプションがネイティブ実行可能ファイルの生成に渡されているのか、あるいはサードパーティのjarにネイティブイメージの設定が埋め込まれていて、それがネイティブイメージの呼び出しに届いているのかを検出するのに非常に役立ちます。

source: Even stricter configuration setup
ja_jp: さらに厳格な設定のセットアップ

source: Even though GitHub supports `OAuth2` only, we will use a `Vert.x OIDC` term. OIDC is built on top of OAuth2 and the Vert.x https://how-to.vertx.io/web-and-oauth2-oidc/[Securing a Web Application with OAuth2/OpenID Connect] tutorial also https://how-to.vertx.io/web-and-oauth2-oidc/#openid-connect[talks about OIDC].
ja_jp: GitHub は `OAuth2` のみをサポートしていますが、ここでは `Vert.x OIDC` という用語を使用します。OIDC は OAuth2 の上に構築されており、Vert.x の https://how-to.vertx.io/web-and-oauth2-oidc/[Securing a Web Application with OAuth2/OpenID Connect] チュートリアルでも https://how-to.vertx.io/web-and-oauth2-oidc/#openid-connect[OIDC について言及されています]。

source: Even though Kubernetes has built-in support for service discovery, sometimes we need more flexibility in the service instance selection. As we have seen, the Kubernetes service implements a round-robin. With Stork, you can customize the selection.
ja_jp: Kubernetesにはサービスディスカバリーのサポートが組み込まれていますが、サービスインスタンスの選択にもっと柔軟性が必要な場合もあります。これまで見てきたように、Kubernetesのサービスはラウンドロビンを実装しています。Storkでは、この選択をカスタマイズすることができます。

source: Even though automatic binding was developed to eliminate as much manual configuration as possible, there are cases where modifying the generated `ServiceBinding` resource might still be needed. The generation process exclusively relies on information extracted from the application and the knowledge of the supported Operators, which may not reflect what is deployed in the cluster. The generated resource is based purely on the knowledge of the supported bindable Operators for popular service kinds and a set of conventions that were developed to prevent possible mismatches, such as:
ja_jp: 自動バインディングは手動での設定をできるだけ排除するために開発されましたが、生成された `ServiceBinding` リソースを修正しなければならない場合もあります。生成プロセスはアプリケーションから抽出された情報とサポートされる Operator のナレッジにのみ依存しており、これはクラスターにデプロイされているものを反映していない可能性があります。生成されるリソースは、一般的なサービス kind のサポートされているバインディング可能な Operator のナレッジと、以下のようなミスマッチの可能性を防ぐために開発された一連の規約にのみ基づいています。

source: Even though this option is a class loading option it will also affect the generated application, so when the application is created removed resources will not be accessible.
ja_jp: このオプションはクラスローディングオプションですが、生成されたアプリケーションにも影響するため、アプリケーションが作成されると、削除されたリソースにはアクセスできなくなります。

source: Even though you configure the extension to support the authorization code flows without `IdToken`, an internal `IdToken` is generated to standardize the way `quarkus-oidc` operates. You use an `IdToken` to support the authentication session and to avoid redirecting the user to the provider, such as GitHub, on every request. In this case, the session lifespan is set to 5 minutes, which you can extend further as described in the <<session-management,session management>> section.
ja_jp: `IdToken` なしで認可コードフローをサポートするようにエクステンションを設定しても、 `quarkus-oidc` の動作方法を標準化するために内部で `IdToken` が生成されます。 `IdToken` を使うのは、認証セッションをサポートするためと、リクエストのたびにユーザーを GitHub などのプロバイダーにリダイレクトさせないためです。 この場合、セッションの有効期限は5分に設定されています。 xref:session-management[セッション] 管理のセクションで説明するように、さらに延長することができます。

source: Even though you configure the extension to support the authorization code flows without `IdToken`, an internal `IdToken` is generated to standardize the way `quarkus-oidc` operates. You use an internal `IdToken` to support the authentication session and to avoid redirecting the user to the provider, such as GitHub, on every request. In this case, the `IdToken` age is set to the value of a standard `expires_in` property in the authorization code flow response. You can use a `quarkus.oidc.authentication.internal-id-token-lifespan` property to customize the ID token age.
ja_jp: `IdToken` なしで認可コードフローをサポートするようにエクステンションを設定しても、 `quarkus-oidc` の動作を標準化するために内部 `IdToken` が生成されます。 認証セッションをサポートし、リクエストごとにユーザーを GitHub などのプロバイダーにリダイレクトしないようにするには、内部 `IdToken` を使用します。 この場合、 `IdToken` の有効期間は、認可コードフローのレスポンス内の標準の `expires_in` プロパティーの値に設定されます。 ID トークンの有効期間をカスタマイズするには、 `quarkus.oidc.authentication.internal-id-token-lifespan` プロパティーを使用できます。

source: Even though you configure the extension to support the authorization code flows without `IdToken`, an internal `IdToken` is generated to standardize the way `quarkus-oidc` operates. You use an internal `IdToken` to support the authentication session and to avoid redirecting the user to the provider, such as GitHub, on every request. In this case, the `IdToken` age is set to the value of a standard `expires_in` property in the authorization code flow response. You can use a `quarkus.oidc.authentication.internal-id-token-lifespan` property to customize the ID token age. The default ID token age is 5 minutes, which you can extend further as described in the <<session-management,session management>> section.
ja_jp: `IdToken` なしで認可コードフローをサポートするようにエクステンションを設定しても、 `quarkus-oidc` の動作を標準化するために内部 `IdToken` が生成されます。 認証セッションをサポートし、リクエストごとにユーザーを GitHub などのプロバイダーにリダイレクトしないようにするには、内部 `IdToken` を使用します。 この場合、 `IdToken` の有効期間は、認可コードフローのレスポンス内の標準の `expires_in` プロパティーの値に設定されます。 ID トークンの有効期間をカスタマイズするには、 `quarkus.oidc.authentication.internal-id-token-lifespan` プロパティーを使用できます。 ID トークンの有効期間はデフォルトで 5 分ですが、<<session-management,session management>> セクションで説明されているとおり延長できます。

source: Even when metrics are enabled in your application, the Cassandra client will not report any metrics, unless you opt in for this feature. So your next step is to enable Cassandra metrics in your `application.properties` file.
ja_jp: アプリケーションでメトリクスが有効になっている場合でも、この機能をオプトインしない限り、Cassandra クライアントはメトリクスを報告しません。そのため、次のステップとして、 `application.properties` ファイルで Cassandra メトリクスを有効化してください。

source: Even when metrics are enabled in your application, the Cassandra client will not report any metrics, unless you opt-in for this feature. So your next step is to enable Cassandra metrics in your `application.properties` file.
ja_jp: アプリケーションでメトリクスが有効になっている場合でも、この機能をオプトインしない限り、Cassandra クライアントはメトリクスを報告しません。そのため、次のステップとして、 `application.properties` ファイルで Cassandra メトリクスを有効化してください。

source: Even when only one database extension is installed, named databases need to specify at least one build time property so that Quarkus knows they exist. Generally this will be the `db-kind` property, although you can also specify Dev Services properties to create named datasources (covered later in this guide).
ja_jp: データベースエクステンションが1つしかインストールされていない場合でも、名前付きデータベースは、Quarkusがその存在を認識できるように、少なくとも1つのビルド時プロパティを指定する必要があります。通常、これは `db-kind` プロパティになりますが、名前付きデータソースを作成するためにDevServicesプロパティを指定することもできます（このガイドで後述します）。

source: Even when only one database extension is installed, named databases need to specify at least one build-time property so that Quarkus can detect them. Generally, this is the `db-kind` property, but you can also specify Dev Services properties to create named datasources according to the xref:databases-dev-services.adoc[Dev Services for Databases] guide.
ja_jp: データベースエクステンションが1つしかインストールされていない場合でも、名前付きデータベースをQuarkusで検出できるように、少なくとも1つのビルド時プロパティを指定する必要があります。 一般的に、これは `db-kind` プロパティですが、 xref:databases-dev-services.adoc[Dev Services for Databases] のガイドに従って、名前付きデータソースを作成するためにDev Servicesプロパティを指定することもできます。

source: Even when you install only one database extension, named datasources must set at least one build-time property so Quarkus can detect them. In most cases, set `db-kind`.
ja_jp: データベースエクステンションを 1 つしかインストールしていない場合でも、Quarkus がそれらを検出できるように、名前付きデータソースには少なくとも 1 つのビルド時プロパティーを設定する必要があります。 ほとんどの場合、 `db-kind` を設定します。

source: Even with all the tracing infrastructure in place the datasource tracing is not enabled by default, and you need to enable it by setting this property:
ja_jp: すべてのトレース基盤が整っていても、データソースのトレースはデフォルトでは有効になっていないので、このプロパティを設定して有効にする必要があります：

source: Even with all the tracing infrastructure in place the mongodb tracing is not enabled by default, and you need to enable it by setting this property:
ja_jp: すべてのトレースインフラストラクチャーが整っていても、mongodb トレースはデフォルトでは有効になっていないため、次のプロパティーを設定して有効にする必要があります。

source: Even with all the tracing infrastructure in place, the datasource tracing is not enabled by default, and you need to enable it by setting this property:
ja_jp: すべてのトレースインフラストラクチャーが整っていても、データソーストレースはデフォルトでは有効になっていません。そのため、次のプロパティーを設定して有効にする必要があります。

source: Even with container reuse enabled, containers will only be reused if their startup command did not change: same environment variables (username/password in particular), same port bindings, ...
ja_jp: コンテナの再利用を有効になっていても、コンテナは起動コマンドが次を変更しない場合にのみ再利用されます。 同じ環境変数 (特にユーザー名/パスワード)、同じポートバインディング...

source: Even with container reuse enabled, containers will only be reused if their startup command did not change: same environment variables (username/password in particular), same port bindings, same volume mounts, ...
ja_jp: コンテナの再利用を有効にしても、コンテナは起動コマンドが次を変更しない場合のみ再利用されます: 同じ環境変数（特にユーザー名/パスワード）、同じポートバインディング、同じボリュームマウント、...

source: Even with the infusion of reactive at the core of Quarkus, RESTEasy _classic_ kept this dispatching strategy. It was fragmenting the Quarkus ecosystem. On one side, we had the the imperative camp using RESTEasy _classic_, Hibernate ORM... On the other side, we had the reactive camp using Reactive Routes, Vert.x APIs and other reactive extensions. Both were using, under the hood, the reactive engine of Quarkus, but the reactive camp we using it in a more efficient way.
ja_jp: Quarkusの中核にリアクティブを導入しても、RESTEasy _classic_はこのディスパッチ戦略を維持していました。このことが、Quarkusのエコシステムを分断していました。一方では、RESTEasy _classic_やHibernate ORMを使用する命令型の陣営があり、もう一方では、Reactive Routes、Vert.x API、その他のリアクティブなエクステンションを使用するリアクティブ型の陣営がありました。どちらもフードの下ではQuarkusのリアクティブエンジンを使用していましたが、リアクティブ派はより効率的な方法で使用していました。

source: Even worse, if a certificate gets revoked because of a security breach, all applications that embed this certificate need to be rebuilt and redeployed in a timely manner.
ja_jp: さらに悪いことに、セキュリティ侵害が原因で証明書が失効した場合、その証明書を組み込んだすべてのアプリケーションを適時に再構築し、再展開する必要があります。

source: Event Implementation Policy
ja_jp: イベント実施ポリシー

source: Event Statistics Service
ja_jp: イベント統計サービス

source: Event Stream and Server-Sent Event support
ja_jp: イベントストリームとサーバー送信イベントのサポート

source: Event description
ja_jp: イベントの説明

source: Event more debugging information than `TRACE`, maybe with even higher frequency.
ja_jp: イベント `TRACE` よりも多くのデバッグ情報、さらに高頻度である可能性があります

source: Event statistics UI: http://localhost:8085[http://localhost:8085^]
ja_jp: イベント統計UI link:http://localhost:8085[： http://localhost:8085, window=_blank]

source: Event-Driven Architecture
ja_jp: イベント駆動型アーキテクチャ

source: Event-driven Architectures
ja_jp: イベント駆動型アーキテクチャー

source: Event-driven messaging systems have become the backbone of most modern applications, enabling the building of message-driven microservices or complex data streaming pipelines.
ja_jp: イベント駆動型メッセージングシステムは、ほとんどの最新アプリケーションのバックボーンになっています。 これにより、メッセージ駆動型マイクロサービスや複雑なデータストリーミングパイプラインのビルドが可能になります。

source: Event-loop
ja_jp: イベントループ

source: Event-loop threads: which are responsible, among other things, for reading bytes from the HTTP request and writing bytes back to the HTTP response
ja_jp: イベントループスレッド: HTTPリクエストからのバイトの読み込みとHTTPレスポンスへのバイトの書き戻しを担当します。

source: Events
ja_jp: イベント

source: Events and Actions
ja_jp: イベント、アクション

source: Events and Observers
ja_jp: イベントとオブザーバー

source: Events and observer methods, including asynchronous events and transactional observer methods
ja_jp: 非同期イベントとトランザクションオブザーバーメソッドを含むイベントとオブザーバーメソッド

source: Events from the downstream
ja_jp: 下流からのイベント

source: Events from the upstream
ja_jp: 上流からのイベント

source: Eventually configure a mcastPort if you want to avoid creating a cluster with another container
ja_jp: 他のコンテナとのクラスタ作成を避けたい場合は、最終的にmcastPortを設定します。

source: Eventually we got all the required libraries to work in native mode, and we could switch efforts toward migrating the application to look like a _real_ Quarkus application:
ja_jp: 最終的には、必要なライブラリがすべてネイティブモードで動作するようになったので、アプリケーションを _本物の_Quarkusアプリケーションのように移行する作業に切り替えることができました。

source: Every **runtime** extension artifact **must** include this file. This file is read by the Quarkus bootstrap mechanism and is meant to contain only the information that is relevant for **building or bootstrapping** an applications. This file is typically generated by the corresponding Quarkus Maven or Gradle plugin when the extension project is built and shouldn't be edited manually. The following properties may appear in this file:
ja_jp: すべての **ランタイム** エクステンションアーティファクトには、**必ず**このファイルが含まれている必要があります。このファイルは Quarkus ブートストラップメカニズムで読み取られ、アプリケーションの **ビルドまたはブートストラップ** に関連する情報のみを含むためのものです。このファイルは通常、エクステンションプロジェクトのビルド時に対応する Quarkus Maven または Gradle プラグインによって生成され、手動で編集してはなりません。このファイルには、次のプロパティーが表示される場合があります。

source: Every **runtime** extension artifact **must** include this file. This file is used by Quarkus dev tools when displaying information about an extension, creating a new project or adding extensions to an existing project, etc. This file isn't used at application build or bootstrap times. The basic and required metadata included in this file can be generated by the Quarkus Maven and Gradle plugins when the extension artifact is built. However, typically, extension authors will want to provide more information about the extension to the Quarkus dev tools and users. The extra information could be provided in a template `META-INF/quarkus-extension.yaml` found in the extension runtime module's resources directory, e.g. `src/main/resources/META-INF/quarkus-extension.yaml`. Here is an example of such a template for the `quarkus-rest` extension:
ja_jp: すべての **runtime** エクステンションアーティファクトには、**必ず** このファイルを含める必要があります。このファイルは、エクステンションに関する情報の表示、新規プロジェクトの作成、既存プロジェクトへのエクステンションの追加などで、Quarkus 開発ツールによって使用されます。このファイルは、アプリケーションのビルド時やブートストラップ時には使用されません。このファイルに含まれる基本および必須のメタデータは、エクステンションアーティファクトのビルド時に、Quarkus Maven および Gradle プラグインによって生成できます。ただし、通常、エクステンションの作成者は、Quarkus 開発ツールやユーザーにエクステンションに関する情報をより多く提供したいと考えます。追加情報は、エクステンションランタイムモジュールのリソースディレクトリー (例: `src/main/resources/META-INF/quarkus-extension.yaml`) にあるテンプレート `META-INF/quarkus-extension.yaml` で提供できます。以下は、`quarkus-rest` エクステンションのそのようなテンプレートの例です。

source: Every **runtime** extension artifact **must** include this file. This file is used by Quarkus dev tools when displaying information about an extension, creating a new project or adding extensions to an existing project, etc. This file isn't used at application build or bootstrap times. The basic and required metadata included in this file can be generated by the Quarkus Maven and Gradle plugins when the extension artifact is built. However, typically, extension authors will want to provide more information about the extension to the Quarkus dev tools and users. The extra information could be provided in a template `META-INF/quarkus-extension.yaml` found in the extension runtime module's resources directory, e.g. `src/main/resources/META-INF/quarkus-extension.yaml`. Here is an example of such a template for the `quarkus-resteasy-reactive` extension:
ja_jp: すべての **runtime** エクステンションアーティファクトには、このファイルを含める必要があります。このファイルは、エクステンション関連情報の表示、新規プロジェクトの作成、既存プロジェクトへのエクステンションの追加などで、Quarkus 開発ツールで使用されます。このファイルは、アプリケーションのビルド時やブートストラップ時には使用されません。このファイルに含まれる基本および必須のメタデータは、エクステンションアーティファクトのビルド時に、Quarkus Maven および Gradle プラグインによって生成できます。しかし、通常、エクステンションの作成者は、Quarkus の開発ツールやユーザーにエクステンションに関する情報をより多く提供したいと考えます。このような追加情報は、エクステンションランタイムモジュールのリソースディレクトリー (例: `src/main/resources/META-INF/quarkus-extension.yaml`) にあるテンプレート `META-INF/quarkus-extension.yaml` で提供できます。以下は `quarkus-resteasy-reactive` エクステンションのテンプレート例です。

source: Every Quarkus component that requires the actual http port, like REST Assured, is automatically updated with the real port.
ja_jp: REST Assured のように、実際の HTTP ポートを必要とするすべての Quarkus コンポーネントは、実際のポートで自動的に更新されます。

source: Every bean has exactly one scope.
ja_jp: すべてのBeanは、正確に1つのスコープを持っています。

source: Every class in the `spec` module now has comprehensive Javadoc explaining its purpose, usage, and relationship to the A2A specification. We've also added detailed documentation for integration points in `server-common` and all client modules.
ja_jp: `spec` モジュール内のすべてのクラスには、その目的、使用法、およびA2A仕様との関係を説明する包括的なJavadocが含まれるようになりました。また、`server-common` およびすべてのクライアントモジュールにおける統合ポイントの詳細なドキュメントも追加しました。

source: Every contribution is valuable. It can be a bug report, an example application, a feature request, a fix in the documentation or just feedback.
ja_jp: バグレポート、サンプルアプリケーション、フィーチャーリクエスト、ドキュメントの修正、フィードバック、全ての貢献が有益です。

source: Every developer has their favorite IDE. Learn how to use Quarkus in yours.
ja_jp: 開発者は皆、お気に入りのIDEがあります。あなたのIDEでQuarkusを使う方法をご紹介します。

source: Every extension gets a tile in the Dev UI. The default tile pulls information from the xref:extension-metadata.adoc[extension metadata], which is another reason to spend a bit of time getting the metadata right.
ja_jp: すべてのエクステンションには、Dev UI のタイルが表示されます。デフォルトのタイルは、xref:extension-metadata.adoc[エクステンションメタデータ] から情報を取得します。これは、メタデータを正しく取得するために少し時間をかける必要があるもう 1 つの理由です。

source: Every extension in the link:https://github.com/quarkusio/quarkus-extension-catalog/tree/main/extensions[extension catalog] should appear in http://code.quarkus.io, http://extensions.quarkus.io, and the command line tools. The web pages at http://extensions.quarkus.io are refreshed a few times a delay, so there may be a delay in new extensions showing up there. To debug a missing extension, first:
ja_jp: link:https://github.com/quarkusio/quarkus-extension-catalog/tree/main/extensions[エクステンションカタログ] 内のエクステンションはすべて、 http://code.quarkus.io、 http://extensions.quarkus.io、およびコマンドラインツールに表示されるはずです。 http://extensions.quarkus.io の Web ページは数回遅れて更新されるため、新しいエクステンションが表示されるまでに時間がかかる場合があります。 不足しているエクステンションをデバッグするには、まず次の手順を実行します。

source: Every file in the resulting Fast JAR distribution will appear in the SBOM with the `quarkus:component:scope` property set to `runtime` and `evidence.occurrences.location` field pointing to the location of the component in the application distribution directory, for example
ja_jp: 結果として得られる Fast JAR ディストリビューション内のすべてのファイルは、SBOM に表示されます。その場合、 `quarkus:component:scope` プロパティーは `runtime` に設定され、 `evidence.occurrences.location` フィールドはアプリケーションディストリビューションディレクトリー内のコンポーネントの場所を指しています。

source: Every method of a message bundle interface must define a message template. The value is normally defined by `io.quarkus.qute.i18n.Message#value()`, but for convenience, there is also an option to define the value in a localized file. Message templates are validated during the build. If a missing message template is detected, an exception is thrown and the build fails.
ja_jp: メッセージバンドルインターフェースのすべてのメソッドは、メッセージテンプレートを定義する必要があります。 通常、値は `io.quarkus.qute.i18n.Message#value()` によって定義されますが、利便性のために、ローカライズされたファイル内で値を定義するオプションもあります。 メッセージテンプレートはビルド時に検証されます。 テンプレートが欠落していると検出された場合、例外が出力され、ビルドが失敗します。

source: Every method of a message bundle interface must define a message template. The value is normally defined by `io.quarkus.qute.i18n.Message#value()`, but for convenience, there is also an option to define the value in a localized file.
ja_jp: メッセージバンドルインターフェースの全てのメソッドは、メッセージテンプレートを定義しなければなりません。通常は `io.quarkus.qute.i18n.Message#value()` で定義しますが、利便性のため、ローカライズしたファイルに値を定義するオプションも用意されています。

source: Every now and then it is handy to be able to change the qualifiers of an injection point programmatically. You can do just that with `InjectionPointTransformerBuildItem`. The following sample shows how to apply transformation to injection points with type `Foo` that contain qualifier `MyQualifier`:
ja_jp: プログラムでインジェクションポイントの修飾子を変更できると便利な場合があります。それは、 `InjectionPointTransformerBuildItem` で実行できます。次のサンプルは、修飾子 `MyQualifier` を含むタイプ `Foo` のインジェクションポイント変換を適用する方法を示しています。

source: Every now and then, it is handy to be able to change the qualifiers of an injection point programmatically. You can do just that with `InjectionPointTransformerBuildItem`. The following sample shows how to apply a transformation to injection points with type `Foo` that contain a qualifier `MyQualifier`:
ja_jp: プログラムでインジェクションポイントの修飾子を変更できると便利な場合があります。それは `InjectionPointTransformerBuildItem` で実行できます。次のサンプルは、修飾子 `MyQualifier` を含むタイプ `Foo` のインジェクションポイントに変換を適用する方法を示しています。

source: Every query operation accepts passing parameters by index (`Object...`), or by name (`Map<String,Object>` or `Parameters`).
ja_jp: すべてのクエリ操作は、インデックス( `Object…​`)または名前( `Map<String,Object>` または `Parameters`)でパラメータを渡すことができます。
